export default {
  projections: {
    СотрудникE: {
      кодС: {
        __caption__: 'Код С'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      }
    },
    СотрудникL: {
      кодС: {
        __caption__: 'Код С'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодС: {
      __caption__: 'Код С'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    фамилия: {
      __caption__: 'Фамилия'
    }
  }
};
