export default {
  projections: {
    ЗаказE: {
      кодЗ: {
        __caption__: 'Код З'
      },
      дата: {
        __caption__: 'Дата'
      },
      статус: {
        __caption__: 'Статус'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      контрагент: {
        __caption__: 'Контрагент',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      составЗаказа: {
        __caption__: 'Состав заказа',
        товары: {
          __caption__: '',
          название: {
            __caption__: ''
          },
          ценаЗаЕд: {
            __caption__: ''
          }
        },
        количество: {
          __caption__: ''
        },
        стоимость: {
          __caption__: ''
        }
      }
    },
    ЗаказL: {
      кодЗ: {
        __caption__: 'Код З'
      },
      дата: {
        __caption__: 'Дата'
      },
      статус: {
        __caption__: 'Статус'
      },
      сотрудник: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      контрагент: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    кодЗ: {
      __caption__: 'Код З'
    },
    статус: {
      __caption__: 'Статус'
    },
    контрагент: {
      __caption__: 'Контрагент'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    составЗаказа: {
      __caption__: 'Состав заказа'
    }
  }
};
